{
  "title": "Salvations Made Easy During War Times | Reaching Unbelievers",
  "writer": "Global Catalytic Ministries",
  "mainImage": "https://i.imgur.com/pwxL082.png",
  "downloadedAt": 1744515404744,
  "pages": [
    {
      "type": "text",
      "content": "\"What am I supposed to think about this as a Christian in the West? Am I supposed to be supporting Israel? Am I supposed to be supporting Palestine? Am I supposed to be supporting Iran? I do not know what to think about the situation.”  \n\nWe are going to be covering a little bit of all that, but more specifically we are going to discuss how you can really make a difference during this time. Why does God have you alive right now? Why during the time that Iran is shooting 300 plus missiles? And what can you do that’s part of God’s end time plan?  \n\nIran decided that they were going to join in this fight and shoot missiles all over Israel. This is unprecedented. 300-this is the number of missiles fired this morning. Before this, there was also a terrorist attack that happened in Tel Aviv. It is on the coast. There was a terrorist attack where two men went into Tel Aviv and shot people.  \n\nSince Iran is now involved, we do not know what is going to happen. We do not know if America is going to send armies over there. \n\nWe do not know if other countries are also going to try to get involved in this. Remember that these are not isolated incidents. What we see here is that we have a lot of different connections, several different networks. "
    },
    {
      "type": "subtitle",
      "subtitle": "What Does This Mean For Us As Believers?"
    },
    {
      "type": "text",
      "content": "You are a Christian in the West or in Europe and you are asking, “What does that mean for me?” \n\nI think when it comes to moments like this-wartime moments-there is going to be chaos in the air. There is going to be-especially from unbelievers and sometimes even believers- a sense of uncertainty. \n\nNothing good comes from war.  \n\nPeople are going to die. There are going to be food shortages. All types of negative things could happen. There are a lot of instabilities. There are a lot of uncertainties and unbelievers are going to start to feel the weight of that. \n\nYou can imagine that believers are scared in moments like this. There is a lot of fear in the air in moments like this. "
    },
    {
      "type": "subtitle",
      "subtitle": "What Can You Do As A believer?"
    },
    {
      "type": "text",
      "content": "First, you will have people that come up to you and start mentioning these things throughout your day. A friend at the gym will ask, “Did you see the news? You know, it is World War III. Iran has attacked Israel.”  \n\nPeople are going to be asking you questions as an individual, not even as a believer. Even unbelievers are going to start this conversation. "
    },
    {
      "type": "subtitle",
      "subtitle": "Make Disciples "
    },
    {
      "type": "text",
      "content": "This is what we do here at GCM. We want to make disciple of Jesus. We want people to experience the love and the peace of God in their lives, wherever they are at in their journey in life.  \n\nThis is an opportunity for some of you that have been wrestling with how to love the unbelievers in your life. You have so many unbelieving co-workers and friends. There are so many people that you run into in the grocery store, the gym, or your apartment building.  \n\nMoments like this, where there is a lot of fear in the air and uncertainties, these individuals are going to start coming to you and bringing this up. \n\nThey may say, “Oh my gosh, I’m so anxious-have you seen the news?” Or “I have questions. I do not know what is going on in the Middle East.” \n\nAnd this is where as believers, we need to make sure that we are educated both on what is going on in the Middle East as well as what is the biblical end time story. \n\nWe have clues to that in Revelation. We also have incredible resources. We work with Joel Richardson, who has an entire end times series on YouTube, which you can go ahead and find. \n\nThe questions are going to come, which means that opportunities to interact with people and share Jesus with people are going to come.  "
    },
    {
      "type": "subtitle",
      "subtitle": "I Have Peace "
    },
    {
      "type": "text",
      "content": "Just this morning, I had my sibling text me. She was asking if I had seen what was going on in the news. And if they are unbelievers, those are opportunities to respond “Yeah, I know what is going on, but I am good. I have a lot of peace and understanding.” \n\n“Wait, wait, wait a second. What are you talking about? How do you have peace in a moment like this? What do you mean? I am missing something that you have.” \n\nSo, this is an entryway into a conversation that can lead to deeper questions. "
    },
    {
      "type": "subtitle",
      "subtitle": "Ask Questions "
    },
    {
      "type": "text",
      "content": "These are moments where you can start asking those hard-hitting questions that most people do not ask themselves because they are consumed with their life.  \n\nAs believers, we want to make sure that when people start approaching us with these topics, we are educated. We need to be prepared and willing to talk and have moments with those individuals. We do not know when we are going to have another chance like this.  \n\nThat is why I named this, “Salvation’s Made Easy During Wartime;” during war times people are coming to you. "
    },
    {
      "type": "subtitle",
      "subtitle": "Opportunities  "
    },
    {
      "type": "text",
      "content": "These are opportunities that we do not want to waste as believers. When people have a lot of fear, what are they looking for? They are looking for peace. So, they are looking for Jesus. \n\nThey are looking for joy. They are looking for certainty. That is what we have as believers. We have certainty in our Lord Jesus Christ.  \n\nThis means that I have peace. And when I am afraid, I can put my trust in Jesus.  \n\nPsalm 56:3 says, “When I am afraid, I put my trust in you, Lord.”  \nEven for us as believers, I know that this is scary. I know that some of you have kids. Some of you have families. Some of you have family members in a different part of the world and are concerned for their safety. But when I am afraid, I can put my trust in the Lord. I can trust that the Lord is going to work all things out for my good. Psalm 56.3 says that.  \n\nIsaiah 41:10 “Do not fear, for I am with you. Do not be dismayed, for I am your God. I will strengthen you and help you. I will uphold you with my righteous hand.” "
    },
    {
      "type": "subtitle",
      "subtitle": "Share with Unbelievers "
    },
    {
      "type": "text",
      "content": "You could say, “I have noticed that you have felt a little anxious. What do you usually do when you are anxious?” \n\nStart asking those probing questions, rather than necessarily teaching them anything. Start to gauge where they are in their thoughts about God. Do they have any understanding of the Bible? Do they have any type of relationship with God? If so, how deep is that relationship? Have they ever made any sacrifices for God? You can continue to ask them specific questions. \n\n“Why do you feel like you are afraid? Do you feel like God is protecting you if you believe in Him? Do you feel like God has abandoned humanity?” \n\nOnce you have done that, you can gauge if the person understands the Word. Now you know how to move forward. \n\nIf this is new for you or you would like to have more training for these types of conversations, we have an incredible disciple-making course at catalyticministries.com. You can enroll in that today, and that is completely free.  \n\nThis is an entire series of videos that is going to make it quite easy for you in situations like this to be able to walk with someone who does not know anything about God and take them on a journey of how to know Jesus.  "
    },
    {
      "type": "subtitle",
      "subtitle": "Go Make Disciples "
    },
    {
      "type": "text",
      "content": "The book of Matthew, says, “Go out into all the nations and make disciples.” \n\nI know that that is not popular. That is something that people do not want to hear most of the time. It is tempting to leave the conversation the moment that I mention responsibilities as a Christian. It is easy to convince ourselves, “Oh, I need to do something? I do not want to learn how to make disciples. That is what pastors are for. That is not my job. I do not have any responsibility. I am just here living my best life and whatever blessings the Lord wants to give to me.” \n\nDo not fall into that trap. All of us, if you are a believer in Jesus, we have all been called to make disciples. \n\nNow, what does that mean? A disciple is a student of Jesus’s teachings. So, what you know about Jesus in your life-it is your job to go and to instruct other people about Him. That is what each one of us has been taught to do. "
    },
    {
      "type": "subtitle",
      "subtitle": "Time Is Limited "
    },
    {
      "type": "text",
      "content": "Time is limited. We are getting closer and closer to End Times every single day. This should be exciting for us because we should all be carrying that Maranatha cry in our hearts, which is, “Lord Jesus, come. We want you, Jesus, to come.” \n\nI know that some of us have comfortable lives. Sometimes we do not want Jesus to come because we are comfortable. \n\nBut that is our hope. Our hope is in the Lord returning so that He’d be able to bring justice to this world and be King Jesus over the nations. That should be our heart cry. \n\nWe see this being played out, and time is being wasted. If you have not learned yet how to be able to successfully make a follower of Jesus or a student of Jesus’ teaching- if you do not know how to do that-it’s time to learn. I want to encourage you to learn; do not wait until tomorrow. "
    }
  ]
}