{
  "title": "A Palm Sunday Attack: 50 Christians Killed in Plateau State, Nigeria",
  "writer": "Global Christian Relief",
  "mainImage": "https://i.imgur.com/U80eVtF.jpeg",
  "downloadedAt": 1744994924181,
  "pages": [
    {
      "type": "text",
      "content": "As Palm Sunday, April 13, drew to a close and the global Church marked the beginning of Holy Week, the sound of gunfire rang out in the Nigerian village of Tilengpan Pushit.\n\nArmed militants stormed homes, set fires, and opened fire on families gathered for the night—just as Christians around the world were remembering the Prince of Peace entering Jerusalem. By morning, more than 50 Christians were dead.\n\n“A mass burial is currently underway. There is outrage in the land at the moment,” resident Joseph Chudu Yonkpa told Reuters.\n\nThis small farming village in Plateau state is just one of many across northern and central Nigeria that has experienced violence in recent years linked to deep-rooted tensions—where faith, ethnicity, and land rights collide in devastating ways.\n\nThis latest attack comes just days after extremists killed at least 52 people and displaced 2,000 others in another village in Plateau state.\n\nNigerian Christians—especially in the central and northern regions—have long faced deadly violence driven by a mix of ethnic, economic, and religious tensions. Armed groups like Boko Haram, ISWAP, and radicalized Fulani militants have devastated Christian communities, forcing millions to flee.\n\nNigeria has become known as the “world’s center of Christian martyrs,” with some of the highest recorded deaths due to faith-related violence. The Global Christian Relief Red List confirms Nigeria as the deadliest country in the world for Christians.\n\nEyewitnesses said this attack began late Sunday evening and continued into the early hours of Monday morning. Survivors describe scenes of chaos as villagers tried to flee. Authorities have confirmed that dozens of homes were set ablaze. Many families are now displaced.\n\nYet again, Nigerian believers are forced to start over with nothing.\n\nIn moments like these, families aren’t just fleeing—they’re praying. Trusting that God will lead them through the darkness to safety. And while their journey is filled with hardship, we have the opportunity to join with our brothers and sisters in Christ in prayer.\n\nThe story of the senseless violence in Tilengpan Pushit on Palm Sunday isn’t just their story. It’s our story. When one part of the body suffers, the whole body feels it.\n\n“Remember those in prison, as though you were in prison with them, and the mistreated, as though you yourselves were suffering bodily.” (Hebrews 13:3, CSB)\n\nAs we remember Jesus’ journey to the cross this week, our brothers and sisters in Nigeria are bearing fresh wounds for following Him.\n\nBut just as the cross wasn’t the end of the story, this isn’t either."
    }
  ]
}
