{
  "title": "Four Nigerian governors accused of alleged complicity in Fulani jihadist attacks against Christians, face international isolation campaign",
  "writer": "Christian Daily",
  "mainImage": "https://i.imgur.com/ZBRHODd.png",
  "downloadedAt": 1744518680858,
  "pages": [
    {
      "type": "text",
      "content": "A Nigerian human rights and advocacy group has accused four governors in South-East Nigeria for their alleged inaction in preventing religious violence. In a report released on April 3, the International Society for Civil Liberties and Rule of Law (InterSociety) blamed Governors Peter Mbah of Enugu state, Charles Soludo of Anambra state, Francis Nwaifuru of Ebonyi state and Hope Uzodinma of Imo state for what it calls “conspiracy of silence and inaction maintained by their governments.”\n\nInterSociety, which also conducts investigative research advocacy, based its indictment on “several public reports” and its own investigative findings, which conclude that the four governors and their governments were violators of religious freedom in Nigeria. \n\nThe investigative findings of InterSociety also indicate that complicity in religious freedom violations in Nigeria is not limited to armed radical Islamists but extends to state and non-state actors, including their sponsors, as well as some \"Christian leaders and Christian politicians.\"\n\nThe report claims that the governors have sweeping powers and responsibilities to curtail the perennial attacks but have \"substantially failed\" to ensure the security and safety of their territories and people. InterSociety alleges that this failure to take decisive action has left people vulnerable to attacks by \"clandestinely protected Islamic Jihadists\" using cattle-rearing and ranching as a pretext. The South-East region is highlighted as Nigeria's largest Catholic and second-largest Christian region.\n\nAdditionally, the report accused the governors and the Nigerian government of perpetuating a “silence of the graveyard” that has allowed and emboldened jihadist Fulani herdsmen responsible for the death of 9,500 people, forced displacements and destruction of property since 2015/2016, with a significant upsurge since 2020/21.\n\nThe organization asserts that these states are now “saturated by jihadist activities” across many of their 78 local government areas, posing a significant threat to the “defenseless Trado-Judeo-Christians” in their hinterlands.\n\nInterSociety claims that many jihadist activities under the watch of these governors in Anambra, Enugu, Imo, and Ebonyi are either underreported, suppressed or censored.\n\n“Several reports also abound exposing indiscriminate third-party land purchases for the Jihadists across the South-East by delegated persons or State/Federal Government remotely linked middle persons including top Government officials or appointees or others closed to their governments,” noted the report signed by InterSociety lead researcher Emeka Umeagbalasi and three other officials. \n\nConsequently, InterSociety has announced plans to launch an international campaign to pressure the mentioned State governments and governors to urgently act in safeguarding religious freedoms in their respective states. Among the measures the organization is pursuing is a visa ban and international isolation campaigns against the four governors, targeting democratic and religious freedom-respecting countries such as the United Kingdom, the United States, the European Union and Canada. The organization states that these campaigns will also extend to the nuclear families of the accused governors."
    },
    {
      "type": "image",
      "image": "https://i.imgur.com/tALAES7.png",
      "uploadDate": "4/13/2025, 12:31:05 AM"
    },
    {
      "type": "text",
      "content": "Additionally, InterSociety is advocating for the U.S. government to re-designate Nigeria as a \"Country of Particular Concern\" (CPC) for egregious violations of international religious freedom and to include \"Jihadist Fulani Herdsmen\" and \"Jihadist Fulani Bandits\" on the international list of \"Entities of Particular Concern.\" \n\nThe group expresses its agreement with the U.S. Commission on Religious Freedom (USCIRF)'s 2025 recommendation to designate Nigeria as a CPC. InterSociety, however, disagrees with USCIRF's omission of Jihadist Fulani Herdsmen and Jihadist Fulani Bandits from its list of recommended terror entities, arguing that these two groups account for over 75 percent of abductions, disappearances, killings and destruction of property, including churches and Christian schools, since 2015.\n\nInterSociety highlights the alarming statistics of more than 145 Catholic priests abducted since 2015, with at least 12 abducted in the first three months of 2025 alone. The publication of the report comes in the same week where Fulani terrorists killed more than days 60 Christians in Plateau state, Northern Nigeria in what the governor called a “genocide,” sources said.\n\nThe attacks were carried out against seven Christian communities in Bokkos County, including Hurti village, where more than 40 Christians were slain, said community leader Maren Aradong.\n\n“More than 1,000 Christians were displaced [in Hurti] during the attacks, and 383 houses were destroyed by these bandits,” Aradong told Christian Daily International-Morning Star News. “These attacks began on Wednesday, 2 April, at about 3 p.m., when these armed Muslim Fulani herdsmen invaded our communities in large numbers; they came on motorcycles and attacked us.”"
    }
  ]
}