{
  "title": "Fulani militias kill 28 Christians in central Nigeria",
  "writer": "Christian Daily",
  "mainImage": "https://i.imgur.com/Dn2r8uK.png",
  "downloadedAt": 1744579034707,
  "pages": [
    {
      "type": "text",
      "content": "Fulani terrorists killed nine Christians in one area of Plateau state, Nigeria in the past month, after killing 19 in another area of the state in March, sources said.\n\nIn Bassa County, Fulani herdsmen attacked Hwrra village on Monday (April 7), killing three Christians identified as Yakubu Mali, 48, Mangwa Ive, 40, and Ezra Riti, 51, said Joseph Chudu Yonkpa, a youth leader from the area. The killings followed an ambush by Fulani militias the previous day in Hukke village, where Christians narrowly escaped death, he said.\n\n“This incident is part of a disturbing trend of attacks that have claimed the lives of Christians in the last four weeks” Yonkpa said. “On April 2, Mr. Dewi Terry Nah, 33 years old, from Nzharuvo, was stabbed to death by Fulani militias along Twin Hill (Gyu). On March 24, Fulani militias launched an ambush opposite the shooting range, Twin Hill, killing Mr. Dumba Yohanna Monday, 33 years old, and another person narrowly escaped.”\n\nOn March 23, Fulani militias ambushed Christians in Dundu village, killing John Avia, 48, Sunday Dickson, 32, and Peter Dickson, 30, he said. On March 13, Fulanis attacked two Christians at their farm in Yhwiba, killing Audu Buge, 24, while Iche Sunday survived with serious injuries and was receiving hospital treatment."
    },
    {
      "type": "text",
      "content": "“The atrocities committed by Fulani militias against Christians here extends beyond ambushes and attacks, as their cattle have been grazing on our farms with impunity, rendering countless families jobless and hungry as their only source of livelihood is destroyed,” Yonkpa said. “The continued killings and destruction of our Christians’ means of livelihood are deliberate attempts to turn our Christian communities into a lawless one.”\n\nHe called on the Nigerian government and security agencies to immediately arrest, halt and prosecute perpetrators and accomplices of heinous crimes against Christians.\n\nRuth Ki, a cybersecurity expert and criminologist from the area, said 1,107 Christians have been killed in Bassa County since 2001 in 2,866 attacks that destroyed about 27,330 farmlands.\n\n“These figures are not mere statistical abstractions. Each fatality signifies a life violently cut short,” Ki said in a report on the violence. “Each destroyed farmland represents a collapsed means of livelihood, plunging entire households into food insecurity and economic vulnerability. Beyond the data lies a grim humanitarian reality: communities destabilized, survivors left without psychosocial support, and local economies decimated.”\n\n\nSeveral other counties in Plateau state – including Barkin Ladi, Mangu, Riyom and Bokkos – have also suffered protracted armed violence, with significant casualties and destruction, she said."
    },
    {
      "type": "text",
      "content": "“Why have existing security structures failed to contain or deter these repeated incursions over a span of two decades?” she asked. “Are there systemic intelligence and operational deficiencies within both local and national security agencies?”\n\nThe violence in Bassa is mirrored across other conflict-prone Local Government Areas in Plateau state, all of which demand more than reactive security deployments, she said.\n\n“It calls for a comprehensive, intelligence-driven and people-centered approach that prioritizes human security, builds local resilience, and restores state legitimacy,” Ki said. “The numbers tell a tragic story, but the human cost demands immediate, strategic and sustained action.”"
    },
    {
      "type": "image",
      "image": "https://i.imgur.com/BTobrGm.jpeg",
      "uploadDate": "4/13/2025, 5:16:49 PM"
    },
    {
      "type": "subtitle",
      "subtitle": "Bokkos Attacks"
    },
    {
      "type": "text",
      "content": "In Bokkos county, Fulani herdsmen last month killed 19 Christians in three separate attacks, residents said.\n\nKefas Mallau said 10 Christians attending a wake at the home of the deceased in Ruwi village were killed by Fulani terrorists the night of March 28 at about 10 p.m. Slain were seven women and three men, and two other Christian women were seriously injured, he said.\n\n“The Christian victims were mostly women, and the herdsmen who attacked them invaded the house where prayers were being held for a deceased member of the community,” Mallau said. “Some of the victims were shot while others were cut with machetes by the terrorists.”\n\nThe Rev. Charles Musa, an area pastor, confirmed the attack.\n\n“Bokkos Local Government as a whole and part of Mangu Local Governments have been under siege for about one and a half years,” Pastor Musa told Christian Daily International-Morning Star News. “The Plateau state government has put in so much but insufficient efforts to curb the menace. However, the federal government of Nigeria seems to have abandoned the people to their fates.”\n\nAlmost every week a Christian is either killed on his farm or innocent Christians are attacked and killed in their homes or kidnapped, he said.\n\n“The marauding Fulani herdsmen go about grazing brazenly on farms/crops of Christians and threaten any Christian who dares to stop them from damaging his crops,” Pastor Musa said.\n\nAnother Bokkos area pastor, the Rev. Ayuba Matawal, said daily news of Christians being killed was alarming.\n\n“Many of these attacks result in mass burials. The sight of numerous corpses and the frequent need to conduct mass burials is something no minister wishes to experience, yet it has become our reality,” Pastor Matawal told Christian Daily International-Morning Star News. “Daily kidnappings, molestation and rape of Christian women, particularly in rural villages across north-central Nigeria, especially in Plateau state, have become disturbingly common.”\n\nIn Pyakmalu village in Bokkos County on March 6, Fulanis stormed the home of the late Rev. Nuhu Lagan and murdered his widowed wife, Mama Rifkatu Nuhu, 84, his son, 56-year-old Ayuba Nuhu Lagan, and grandchildren, 8-year-old Melody and 5-year-old Justice, Pastor Matawal said.\n\nOn March 3 in Hurti village, Fulanis killed five Christians, he said.\n\n“Fulani herdsmen, mainly Fulani Muslim extremists, launched another rampage, indiscriminately shooting and setting villages on fire,” he said. “The attacks in Hurti and other villages in the Mangu District, Bokkos Local Government Area of Plateau state, left destruction in their wake. We could not sleep through the night, as we waited for the morning news. We already knew that at least five Christians have been killed, their bodies awaiting mass burial.”\n\nSamuel Amalau, chairman of the Bokkos Local Government Council, said in a press statement that he strongly condemned the recent attacks by herdsmen.\n\nAlfred Alabo, spokesman for the Plateau State Police Command, expressed condolences to the community following the attack on the wake in Ruwi village.\n\n“Some law-abiding citizens of the community who were attending a wake-keep to mourn the passing of their loved ones tragically lost their lives, while others sustained varying degrees of injuries,” Alabao said in a press statement.\n\nThe commissioner of police has directed the area commander of Pankshin to relocate to Bokkos for strict supervision of all operations and prevent a recurrence until normalcy is fully restored, he said.\n\nNumbering in the millions across Nigeria and the Sahel, predominantly Muslim Fulani comprise hundreds of clans of many different lineages who do not hold extremist views, but some Fulani do adhere to radical Islamist ideology, the United Kingdom’s All-Party Parliamentary Group for International Freedom or Belief (APPG) noted in a 2020 report.\n\n“They adopt a comparable strategy to Boko Haram and ISWAP and demonstrate a clear intent to target Christians and potent symbols of Christian identity,” the APPG report states.\n\nChristian leaders in Nigeria have said they believe herdsmen attacks on Christian communities in Nigeria’s Middle Belt are inspired by their desire to forcefully take over Christians’ lands and impose Islam as desertification has made it difficult for them to sustain their herds.\n\nNigeria remained among the most dangerous places on earth for Christians, according to Open Doors’ 2025 World Watch List of the countries where it is most difficult to be a Christian. Of the 4,476 Christians killed for their faith worldwide during the reporting period, 3,100 (69 percent) were in Nigeria, according to the WWL.\n\n“The measure of anti-Christian violence in the country is already at the maximum possible under World Watch List methodology,” the report stated.\n\nIn the country’s North-Central zone, where Christians are more common than they are in the North-East and North-West, Islamic extremist Fulani militia attack farming communities, killing many hundreds, Christians above all, according to the report. Jihadist groups such as Boko Haram and the splinter group Islamic State in West Africa Province (ISWAP), among others, are also active in the country’s northern states, where federal government control is scant and Christians and their communities continue to be the targets of raids, sexual violence, and roadblock killings, according to the report. Abductions for ransom have increased considerably in recent years.\n\nThe violence has spread to southern states, and a new jihadist terror group, Lakurawa, has emerged in the northwest, armed with advanced weaponry and a radical Islamist agenda, the WWL noted. Lakurawa is affiliated with the expansionist Al-Qaeda insurgency Jama’a Nusrat ul-Islam wa al-Muslimin, or JNIM, originating in Mali.\n\nNigeria ranked seventh on the 2025 WWL list of the 50 worst countries for Christians."
    }
  ]
}