{
  "title": "Easter Comes to Myanmar's Christians: Finding Hope Amid Ruins",
  "writer": "Open Doors",
  "mainImage": "https://i.imgur.com/tgYZH8M.jpeg",
  "downloadedAt": 1745379649713,
  "pages": [
    {
      "type": "text",
      "content": "On Sunday, April 20, billions of Christians will celebrate Easter. In almost every nation and language, shouts of \"He is risen\" will ring out, rejoicing that Jesus has become the \"firstfruits\" of the resurrected (1 Corinthians 15:20).\n\nBut this Easter in Myanmar, Christians are worshiping among ruins—and in a climate of fear.\n\nLast month's devastating earthquakes in Myanmar have deeply impacted God's people in the country. Open Doors' local partners are reaching affected believers with vital aid and reminding them they are not alone—but the need is enormous, reinforcing the importance of your continued prayers and support.\n\n\"There are people helping us with food, so we're not worried about meals. But I am concerned about the livelihoods of our church members, as many businesses and workplaces have shut down due to the earthquake.\"\n—Mrs. Aye*, Open Doors' local partner"
    },
    {
      "type": "text",
      "content": "The death toll from the disaster now stands at more than 3,500, with some 4,700 injured. Many are in desperate need of relief and assistance, while people remain trapped under debris.\n\nMany countries—including China, India, Russia, South Korea, the US, and various international organizations—have provided support for affected areas. However, reports have surfaced of police and armed groups forcibly seizing relief supplies intended for victims in Sagaing. And it's believed that the military fired on a Chinese convoy delivering aid.\n\nMeanwhile, the military continues to launch attacks as part of the ongoing civil war. On April 9, a military bombing raid killed more than 30 people in southern Chin State (which is majority Christian) and Sagaing division. Around 50 others, including elderly people and children, were wounded in the aerial strikes.\n\n\"A local believer told us that a Christian pastor and two elderly people were among the deceased,\" says Daisy Htun*, an Open Doors' local partner. \"The bombing also destroyed a church and several homes in a village of Chin State.\"\n\nThe level of need and anguish in Myanmar seems difficult to reconcile with the joy of Easter. It almost seems like the situation has more in common with Good Friday and Holy Saturday—a people in mourning, wondering where their Savior is.\n\nAnd yet, through your gifts and prayers, God's Easter hope is shining through."
    },
    {
      "type": "subtitle",
      "subtitle": "'They thanked us for our visit'"
    },
    {
      "type": "text",
      "content": "When the earthquake happened, Open Doors' local partners were already present in the country to help persecuted believers and were positioned and equipped to reach many people immediately. Through your support, they were able to immediately leap into action.\n\n\"We are able to give aid like rice, drinking water, and mosquito nets to 80 families in need,\" says Min Naing*, a local partner, following a recent distribution. \"We will hand out solar lamps shortly, once they arrive.\n\n\"I visited our volunteer Brother Aung* and his family,\" he continues. \"They were very happy to see us and thanked us for our visit. They were actively helping their church members with restoration work.\"\n\nThere is also good news for Lin* and her husband, Pastor Noah*, who were concerned for their unborn child's welfare after Lin felt unwell following the earthquake. \"I am encouraged by your visit and prayers,\" she says. \"The doctor told me that my child is safe. Thank you so much.\""
    },
    {
      "type": "subtitle",
      "subtitle": "Ongoing need—and ongoing hope"
    },
    {
      "type": "text",
      "content": "There are additional hindrances to reaching people. \"We can't say for sure if the military is blocking aid, but they have been announcing all aid should go through them,\" Min Naing says. \"There are some Christians whom we have heard are able to bring aid, but there were also several who were stopped by the military for reasons unclear to us now.\"\n\nMary*, a local believer, adds: \"All the relief agencies must ask official letters from the state government, which is very difficult. From Yangon to Mandalay, all the relief vehicles are being questioned and detained. It is very hard to reach the Christians in need.\""
    },
    {
      "type": "text",
      "content": "Even as local partners bring aid, the scale of devastation and recovery is clear to see. \"The building's wreckage damaged a neighbor's roof,\" says Zaw Lin, who spoke after visiting a partner's church in central Myanmar. \"The church leaders and pastor's family are now concerned about repairing both their church and their neighbor's property. The church will need to be checked by engineers to assess its structural safety for future use.\n\n\"We also visited Mrs. Aye*, another partner,\" he continues. \"Their church is old and developed cracks because of the earthquake, so they evacuated and set up a shed where believers could gather for fellowship.\"\n\nMrs. Aye told Zaw Lin: \"There are people helping us with food, so we're not worried about meals. But I am concerned about the livelihoods of our church members, as many businesses and workplaces have shut down due to the earthquake.\"\n\nMeanwhile, damaged roads are hindering relief efforts, as is rainfall which also threatens to further spread diseases among those living in tents. But despite these challenges, local partners are committed to reaching the most vulnerable with practical and pastoral support.\n\nChurches will still gather on Easter Sunday—in sheds, amidst rubble, or otherwise—to rejoice in the hope of the resurrection.\n\nThank you for the part you're playing to bring aid and hope to our sisters and brothers in Myanmar this Easter. The need is monumental, but as our local partners report, the practical support—and simply being present with them—is a lifeline to many, helping to meet urgent needs posed by this latest crisis. The hope of the resurrection is alive and well, showing that God's faithfulness can pierce through even the most difficult circumstances.\n\n*Names changed for security reasons"
    }
  ]
}