{
  "title": "70 Christians found beheaded in church in DRC",
  "writer": "Open Doors",
  "mainImage": "https://i.imgur.com/xpFo7RB.jpeg",
  "downloadedAt": 1744425398932,
  "pages": [
    {
      "type": "text",
      "subtitle": "",
      "content": "Christians in DRC have again been left reeling after a heinous act of violence that has left 70 believers dead. Please pray for our brothers and sisters in the country as they face escalating persecution."
    },
    {
      "type": "image",
      "image": "https://i.imgur.com/jqxDQPI.jpeg",
      "uploadDate": "4/11/2025, 12:58:26 AM"
    },
    {
      "type": "text",
      "subtitle": "",
      "content": "Seventy Christians have been found beheaded in a church in the Democratic Republic of Congo (DRC), in what’s the latest devastating attack on believers in the north east of the country.\n\nAccording to field sources, at around 4am last Thursday (13 February) suspected militants from the Allied Democratic Forces (ADF) – a group with ties to so-called Islamic State (IS) – approached homes in Mayba in the territory of Lubero, saying: “Get out, get out and don’t make any noise.” Twenty Christian men and women came out and were captured.\n\nShaken by this incident, people from the local community in Mayba later gathered to work out how to release those held captive. However, ADF militants surrounded the village and captured a further 50 believers.\n\nAll 70 of those kidnapped were taken to a Protestant church in Kasanga where they were tragically killed.\n\nMuhindo Musunzi, director of the Kombo primary school [which belongs to the CECA20 church], says that prior to this incident, churches, schools and health centres had all shut their doors because of the chaotic security situation. “We had to move all activities towards Vunying,” he said.\n\nField sources report that, until yesterday Tuesday 18 February, some families had not been able to bury their dead because of insecurity in the area. Many Christians have now fled the area for their safety.\n\n“We don’t know what to do or how to pray; we’ve had enough of massacres,” says an elder of the CECA20 church. “May God’s will alone be done.”\n\n“This was not just an act of terror. It was a targeted massacre of Christians, and it will not stop here,” says Illia Djadi, Senior Analyst for Freedom of Religion or Belief in sub-Saharan Africa for Open Doors. “The ADF is part of a growing extremist network that wants to wipe out Christianity in the region. If nothing is done, more attacks will follow.”"
    },
    {
      "type": "text",
      "subtitle": "Rise in violence and internal displacement",
      "content": "This latest awful incident is a continuation of the escalating threat posed by ADF militants in the country’s north east region. In 2014, the group intensified attacks in Beni territory in North Kivu province, and since then attacks have spread to the territories of Irumu and Mambasa in Ituri province, and now it’s affecting Lubero. In the last month alone, the group have killed more than 200 people in Baswagha chiefdom, according to a local news website.\n\nThis explains why DRC rose six places to number 35 in the latest World Watch List. Last year, 355 were killed for their faith, compared with 261 the previous year, whilst an estimated 10,000 were internally displaced, which is ten times more than 2023. Houses have been looted and burnt, schools relocated, churches and health facilities closed, and several Christian villages have been abandoned altogether.\n\nThe recent activities of the M23 rebel group – which taken over large parts of North and South Kivu provinces, and is reportedly supported by Rwanda – has added to the vulnerability of Christians. “The chaos created by M23 has opened the door for the ADF to continue its campaign of terror with total impunity,” says Djadi. “Christians in the region have been abandoned. They are completely unprotected, and the world is not paying attention.”\n\nIllia believes that international pressure could be effective in preventing further bloodshed. “We have seen before that international pressure works. In 2012, M23 was stopped when the US and others put diplomatic and economic pressure on Rwanda to withdraw its support. We need that kind of leadership again. Governments must speak up now before more lives are lost.”"
    },
    {
      "type": "text",
      "subtitle": "A call to remain in prayer",
      "content": "“Open Doors strongly condemns this heinous act of violence against civilians and calls upon civil societies, governments and international organisations to prioritise civilian protection in eastern DRC where armed groups, such as the ADF, are operating,” says John Samuel*, Open Doors’ legal expert for the work in sub-Saharan Africa.\n\n“The violence takes place in a context of impunity, where almost no one is held accountable,” he continues. “This massacre is a clear indicator of widespread human rights violations against civilians and vulnerable communities, often targeting Christians, perpetrated by ADF – a [so-called Islamic State] affiliate.\n\n“We further call on the international Christian community to remain in prayer for Christians and vulnerable communities in eastern DRC. Pray for an end to violence and that government at all levels will diligently, impartially, and transparently address the violence and its effects. Pray for the church in Lumbero as she seeks to bring physical and spiritual assistance to the families affected.”\n\n“We must pray for our brothers and sisters in the DRC who are facing unimaginable horror, but we must also act,” adds Djadi. “We need to raise awareness, contact our MPs, and demand that the UK government speaks out. If we stay silent, more Christian lives will be lost.”"
    }
  ]
}