{
  "title": "Killed for following Jesus – four stories of costly faith from Afghanistan",
  "writer": "Open Doors",
  "mainImage": "https://i.imgur.com/XpBq661.png",
  "downloadedAt": 1744465309855,
  "pages": [
    {
      "type": "text",
      "content": "It’s always been rare to get stories about believers in Afghanistan, given the secrecy in which they must live. The Taliban’s takeover just over two years ago has made this even harder. But four stories of courageous martyrs have been shared with Open Doors contacts recently, with each one highlighting the extreme dangers facing our brothers and sisters in Afghanistan. Please continue to pray for them. (Please note that you might find some of the content below distressing.)"
    },
    {
      "type": "text",
      "content": "The Taliban’s takeover of Afghanistan in August 2021 has forced Christians from the country or deeper underground (illustative image)"
    },
    {
      "type": "subtitle",
      "subtitle": "Drowned by own father"
    },
    {
      "type": "text",
      "content": "After becoming a Christian, Aasif* had a dream to return to his birthplace to share the gospel with others. He and his family went, and over two years more than 30 people gave their lives to Jesus through Aasif’s witness.\n\nBut his father grew suspicious. “Aasif’s father was a respected figure in the community and, when we returned home, he could see changes in his son’s behaviour,” says Shaziz*, Aasif’s wife. “The way he was living raised questions. He repeatedly asked Aasif why he no longer prayed or attended the mosque.\n\n“His father started monitoring him for a month, trying to discover who he was meeting with and why his behaviour had changed. One night, when Aasif returned home from one of his groups, his father discovered that he had a book and took it from him. After reading it, he learnt that his son had become a Christian. That night he declared him an infidel and deserving of Islamic punishment.”\n\nA month later, Aasif’s father decided to kill him. “One day, he suggested the two of them go swimming, but instead of spending time together, Aasif’s father drowned him in the water,” recalls Shaziz. “He returned home alone.”\n\nShaziz pressed his father-in-law over Aasif’s whereabouts, but he insisted the two of them never went swimming after all. The following day, Aasift’s body was discovered. \n\n“I knew my father-in-law had killed my husband, but I was too afraid to share the story with anyone,” continues Shaziz. “I feared my father-in-law’s retribution; if I revealed the truth, I might be the next target.\n\n“Forty days after his death, I decided to move back to where we used to live. We have three daughters and three sons. My father-in-law did not provide any support, and there was no one to help me take care of my children or provide for their basic needs. We are now living in a rented house.”\n\nDespite the immense grief and financial struggles, Shazia has not given up hope. She wants to set up her own bakery so she can take care of her family."
    },
    {
      "type": "subtitle",
      "subtitle": "Husband went to buy bread – but never returned"
    },
    {
      "type": "text",
      "content": "“My name is Yasaman*, and I want to share my story with you.\n\n“I got married 11 years ago and have five children aged between one and ten. My husband gave his life to Jesus two-and-a-half years ago. He always tried to share his faith with me, but I was initially uninterested and often argued with him. Our relationship grew strained, and I even contemplated divorce, taking our children to my father’s house.\n\n“One night, I had a dream in which someone asked if I had read the Bible. This dream deeply affected me, prompting me to ask my husband for a Bible to make an informed decision. After reading it, I experienced a profound change within me, feeling a new energy and embracing faith. From that moment on, my husband and I lived a loving life together.\n\n“Our home was located near a mosque, and some people grew suspicious of my husband’s [Christian] activities. Early one morning, as he went to buy bread, two people followed him. He was attacked and killed near our home. \n\n“I was devastated and felt alone and weak. However, a fellow believer and his family came to visit, providing spiritual support and encouraging me to continue my husband’s work in God’s path. I found solace in their support, and my faith grew stronger. I started sharing the gospel with others.\n\n“Now, I am raising my children alone. A few fellow believers offer financial assistance, which covers our food expenses, but little else. I need to consider my children’s future and pray for guidance.”"
    },
    {
      "type": "subtitle",
      "subtitle": "Cousin enraged after spotting Bible"
    },
    {
      "type": "text",
      "content": "Behnam* was living in Iran when he became a Christian. On returning to Afghanistan, he travelled the country telling people about Jesus. Two years ago, he formed groups for Christians to grow in their faith.\n\nOn a visit to Behnan’s home, his cousin spotted a Bible and wanted to know why he had it. He was furious and set out to kill him. After several failed attempts, he enlisted the help of others to complete the job.\n\nBehnam’s wife, Sanaz*, knew the truth about what had happened to her husband, but she couldn’t share it due to her own belief in Jesus and the fear of retaliation.\n\nSanaz – who recently lost her job – is now the sole parent to five young children. The family receive some financial help from fellow Afghan believers, but this only covers their food expenses. Sanaz is looking to be self-supporting, but it is hard in the current economic climate."
    },
    {
      "type": "subtitle",
      "subtitle": "Good behaviour sparks tragedy"
    },
    {
      "type": "text",
      "content": "When a colleague of Gulraiz* noticed his honesty and good behaviour, conversations began that led to Gulraiz sharing his faith. But this angered the colleague, who threatened to expose Gulraiz’s faith to others. \n\nOne day, Gulraiz finished work but did not return home. For 11 days his family searched desperately but found no trace of him. They then received a phone call from the hospital informing them that Gulraiz’s body had been discovered beside a main road. \n\nFollowing her husband’s death, Lalah and her three children have moved to a new location. They live in a rented house, which is paid for by her father, and she works in a tailoring shop which covers basic food expenses. Lalah wants to establish her own tailoring business so she can be self-sufficient, whilst training and empowering other women in tailoring. \n\n*Names changed for security reasons"
    }
  ]
}
